# На прошлом занятии
* чтение из файла и запись в файл


# План этого занятия
* функции: начало


# Функции

Часто бывает удобно один раз написать логически завершённый блок кода и при необходимости запускать его, а не копировать многократно.

Оформляется блок функции так:


```python
def say_hello():
    print('Hello!')
```

def — ключевое слово (сокр. define)

say_hello — название функции,

содержимое блока (в данном случае один вызов print()) — со стандартным отступом.


После того, как мы определили функцию, мы можем её вызывать:

```python
say_hello()
```


Функции могут брать параметры на вход, в этом случае  они указываются в скобках после названия функции:

```python
def say_hello(username, age):
	if len(username) > 0:
		print('Hello, ' + username)
	else:
		print('No username given...')
	if age > 0:
		print('age = ' + str(age))
```

Имена переменных, объявленные внутри функции, не будут видны в остальной программе. ```x``` в функции и ```x``` в остальной программе - это разные переменные.

Вызовем эту функцию дважды:

```python
say_hello("Vasya", 42)
say_hello("", 8)
```


Функции также могут возвращать результат выполненных операций с помощью оператора return:

```python
def choose_max(a, b):
	if a > b:
		return a
	else:
		return b
```


Найдём максимальное из двух чисел:

```python
max_five_three = choose_max(5, 3)

print(choose_max(13, 14))
```

```return``` прекращает выполнения функции, так что помещать её внутрь цикла — плохая идея.

```python
def say_hello():
    print('Hello!')
```

Теперь все программы должны быть написаны так, чтобы код разбивался по функциям. Функции должны быть не длиннее примерно 10 строк. В практике написания кода на питоне принято, чтобы сначала определялись все функции, а потом последовательно вызывались внутри одной - главной - функции, которую обычно называют ```main()```

Совсем правильной композицией кода было бы сначала определить все функции, потом определить главную функцию, а потом вызвать её внутри такой конструкции:

```python
if __name__ == '__main__':
    main()
```



# Домашнее задание

Вам нужно написать программу, порождающую случайные грамматически правильные, но бессмысленные тексты.  

Вместо тысячи объяснений прикладываем два образца программ: [poem_generator.py](https://github.com/morgan1189/HSE-Programming/blob/master/poem_generator.py) порождает стихотворение на русском языке, написанное трехстопным анапестом, [sentence_generator.py](https://github.com/morgan1189/HSE-Programming/blob/master/sentence_generator.py) порождает текст на английском языке. Посмотрев программы, вы поймёте, как такая программа должна быть устроена и какие в ней должны быть функции.  Функции, естественно, не обязательно делать ровно такими же, как в этой программе (и даже желательно сделать их как-нибудь по-своему), но каждая ваша функция должна делать какую-то одну определённую операцию — таким образом, функций у вас в программе должно быть не одна и не две. 

Для работы вам понадобится функция выбора случайного элемента из массива. Чтобы её использовать, в самом начале программы нужно написать

```python
import random
```

— это указание питону использовать модуль [random](https://docs.python.org/3/library/random.html), в котором хранится нужная функция. А сама функция называется random.choice(). Если у Вас есть массив array, то после строчки

```python
x = random.choice(array)
```

x станет равен какому-то случайно выбранному элементу этого массива. В программе sentence_generator.py также есть функция random.randint(x, y), которая выбирает случайное число от x до y.

Слова для текстов должны быть взяты из отдельных txt-файлов, открываемых программой. Эти файлы следует загрузить в репозиторий вместе с кодом выполненного домашнего задания. Также желательно в функции уложить вообще весь код.  Дополнительные ограничения по вариантам:  

1. Текст должен представлять собой правильное хайку, то есть стихотворение на русском языке из трёх строк без рифмы, при этом длина первой строки должна быть 5 слогов, второй строки - 7 слогов, третьей строки - 5 слогов.  Количество предложений в таком тексте может быть любым. 

2. Текст должен представлять собой стихотворение на русском языке из четырёх строк без рифмы, но написанное с соблюдением одной метрической схемы, кроме трёхстопного анапеста. 

3. Текст должен состоять из 5 предложений разных типов (утвердительные, вопросительные, отрицательные, условные, побудительные) на русском языке. Типы предложений должны выводиться в случайном порядке. 

4. Текст должен представлять собой правильное хайку, то есть стихотворение на одном из изучаемых вами языков (французский, итальянский, японский, немецкий, персидский) из трёх строк без рифмы, при этом длина первой строки должна быть 5 слогов, второй строки - 7 слогов, третьей строки - 5 слогов. Количество предложений в таком тексте может быть любым. 

5. Текст должен быть не короче, чем 5 предложений на русском языке. Предложения должны быть сложносочинёнными и сложноподчинёнными. 

6. Текст должен состоять из 5 предложений разных типов (утвердительные, вопросительные, отрицательные, условные, побудительные) на изучаемом вами языке (французский, испанский). Типы предложений должны выводиться в случайном порядке. 

7. Текст должен представлять собой танка, то есть стихотворение на русском языке из пяти строк без рифмы, при этом длина первой строки должна быть 5 слогов, второй строки - 7 слогов, третьей строки - 5 слогов, четвёртая и пятая строка - по 7 слогов. Количество предложений в таком тексте может быть любым. 