# На прошлом занятии
* индексы, срезы
* циклы `for` и `while`

# План этого занятия
* Списки и операции над ними
* индексы и срезы
* вложенные циклы

# Списки
Список (list) — структура данных для хранения упорядоченных элементов. Например:

```python
guests = ["Вася", "Татуся", "Пётр Яковлевич", "мама"]
fib = [0, 1, 1, 2, 3, 5, 8, 13]
letters = list('abracadabra')    # элементы этого списка — элементы исходной строки
my_empty_list = []    # пустой список
teams = ['team_A', 'snakes_team', ['team_B_1', 'team_B_2'], 'СamelsTeam']    # списки могут быть элементами списка
```

Чтобы «прицепить» ещё один элемент в список, используется метод append:

```python
guests.append("John Doe")
```

Объединение списков:

```python
sentences = ["Hello!", "How are you?"] + ["I'm so glad to meet you.", "So, happy."] + ["Long time no see..."]
sentences.extend(["Good bye.", "See you later."])    # добавление элементов одного списка в другой
sents_length = len(sentences)    # длина списка
```


Посмотрите, [как много всего](https://docs.python.org/3/tutorial/datastructures.html) можно делать со списками!



## Индексы и срезы

Главное о списках: их элементы нумеруются ("индексируются") слева направо, счёт начинается с нуля.
К элементам можно обращаться по их индексам: `guests[0]`, `fib[3]`, `letters[2]`. Чтобы считать не слева направо, а наоборот, используют отрицательные индексы: `guests[-1]` – последний элемент списка `guests`,  `letters[-2]` – второй с конца элемент списка `letters`.

Чтобы выделить из списка больше одного элемента, используют срезы (или «слайсы», slice):

```python
head = letters[1:4]    # с первого по третий элементы
first_three = letters[:3]    # то же, что letters[0:3]
tail = letters[4:]      # с четвёртого элемента до конца
last_three = letters[-3:]    # последние три элемента
without_last = letters[:-1]    # все элементы исключая последний
```



# Вложенные циклы

Вложенные циклы позволяют перебрать все возможные пары значений:

```python
for i in range(5):
    for k in range(3):
        print("i =", i, "k =", k)
        print("inner loop")
    print("outer loop")
```

Вложенные списки могут быть перебраны аналогично:

```python
students = [
    ["Софья", "Витовтовна", "Гедиминович"],
    ["Вячеслав", "Ярославович", "Смоленский"],
    ["Давыд", "Святославович", "Черниговский"],
    ["Софья", "Фоминична", "Палеолог"],
]
for student in students:
    print("### Next student")
    for name in student:
        print(name)
```



# На чём можно потренироваться?

## Крестики-нолики
Можно реализовать консольную программу для игры в крестики-нолики, которая на вход запрашивает координаты крестика или нолика, а на выход выдает изображение игрового поля с отметками.



# Домашнее задание
Вам нужно написать программу, которая спрашивает у пользователя слово и, в зависимости от варианта, печатает тот или иной набор строчек. Вместо текстового описания лучше для каждого варианта приведем примеры того, что должно появиться на экране в результате работы программы, если пользователь введёт слово "abracadabra". (Соответственно, если пользователь введёт другое слово, должна получиться другая, но аналогичная картинка.)

## 1.

```
abracadabra
abracadabr
abracadab
abracada
abracad
abraca
abrac
abra
abr
ab
a
```

## 2.

```
a
ab
abr
abra
abrac
abraca
abracad
abracada
abracadab
abracadabr
abracadabra
```

## 3.

```
abracadabra
bracadabraa
racadabraab
acadabraabr
cadabraabra
adabraabrac
dabraabraca
abraabracad
braabracada
raabracadab
aabracadabr
```

## 4. 

```
abracadabra
aabracadabr
raabracadab
braabracada
abraabracad
dabraabraca
adabraabrac
cadabraabra
acadabraabr
racadabraab
bracadabraa
```

## 5.

```
a
ra
bra
abra
dabra
adabra
cadabra
acadabra
racadabra
bracadabra
abracadabra
```

## 6.

```
abracadabra
bracadabra
racadabra
acadabra
cadabra
adabra
dabra
abra
bra
ra
a
```

## 7.

```
abracadabra
bracadabr
racadab
acada
cad
a
```